{
  "ENG": {
    "help": {
      "base": "Here are a list of commands you can perform.\nFor more details enter help followed by a command.\nExample:\nhelp start\nAll commands are input in the prompt window.\ntutorial\nascension\nquit\nseed\nstats\ncomp\nhistory\nvolume\nlang\nachieve\nmod\nleader\npotion\nchoice\npower\nend\nshow\nhide\nChoices\nDeck\nDiscard\nEvent\nHand\nexhaust\nOutput\nLog\nSave\nLoad\nMap\npath\nMonster\nOrbs\nPlayer\nRelic",
      "ascension": "ascension\nThis command lists all the ascension modifiers.",
      "quit": "quit\nWhile in a run, this command saves and quits to main menu.\nWhile on the main menu, this command quits the game.\nAnother easy way to close the game would be to close the ModTheSpire window.",
      "seed": "seed\nThis command displays the run's seed to the output window.\nA seed is used for random number generation.\nIt can be input when starting a run to have a set seed.",
      "stats": "stats\nThis command displays your save file's statistics to output.\nWill not work on a fresh save file.",
      "comp": "comp\nThis is the Compendium command.\nThere are various categories and subcategories.\nThe Categories are\ni for Ironclad\ns for Silent\nd for Defect\nw for Watcher\np for Potions\nr for Relics\nRelics has subcategories.\nThese are i, s, d, w, and sh.\nsh is shared and is all of the shared relics.\nFollowing any command by a number will inspect the item at that index.\nExamples\ncomp i\ncomp s 5\ncomp p\ncomp r w\ncomp r sh 10",
      "history": "history\nThis is the Run History command.\nFrom the main menu you can active the Run History screen.\nAlmost all commands will be disabled while on this screen.\nYou can input close at any time to close Run History.\nRead the Choices window to navigate Run History.\nThere is currently an issues with Run History.\nSome objects are named differently in the code than what they actually are.\nAs Run History only uses text and not abstract objects, it would be difficult to grab the actual name.\nFor now Run History is using these code names.",
      "volume": "volume\nThis displays the current volume settings to output.\nIt can also change the settings.\nThe different volume types are master, music, and sound effects.\nThere is an additional toggle for background ambience sounds.\nThe format is\nvolume master/music/sound number\nThe number needs to be a decimal between 0 and 1.\nExamples:\nvolume master 0.5\nvolume ambience",
      "lang": "lang\nThis displays the current language and available languages.\nChange the language with lang followed by the index of the language you want.\nExample:\nlang 0\nOnly game text like card descriptions and monster names will change.\nThis does not affect the mod's text as it hasn't been translated yet.\nRestart the game for the display to update.",
      "achieve": "achieve\nThis displays to output the list of locked and unlocked achievements.\nachieve number displays the description of a given achievement.\nachieve can be shortened to a.",
      "mod": "mod\nThis displays to output some notes on certain loaded content mods.\nIf a mod isn't listed here then it either works out of the box or hasn't been implemented yet.",
      "leader": "leader\nFrom the main menu this opens up the leaderboard screen.\nThe leaderboard is displayed in the Event window.\nThe Choices window displays the leaderboard options.\nOption 1 is char which is which Character.\nOption 2 is region.\nOption 3 is type.\nFor all options used the format:\n[option] [number]\nExamples:\nchar 1\nregion 0\ntype 2\nUse the commands + and - to shift which ranks to display on the leaderboard.\nUse the command mine while region is set to Global to display your scores.",
      "potion": "potion\nThis command lets you interact with your potions.\nThere are 3 different options.\nuse. discard, and inspect.\nThe format for use is\npotion use [potion number] [enemy number]\nEnemy number is optional for potions without targets.\nThe format for discard is\npotion discard [potion number]\nThe format for inspect is\npotion inspect [potion number]\nInspect displays what the potion does to the output window.\npotion can be shortened to pot, use to u, discard to d, and inspect to i.\nExamples:\npot u 1 1\npot d 2\npot i 1",
      "choice": "choice\nNot to be confused with choices, which is one of the windows.\nchoice displays the info for one of the choices in the choices window in the output window.\nThe format is\nchoice [choice number]\nchoice can be shortened to c.\nExample:\nc 1",
      "power": "power\nThis command inspects one of your or a monster's powers.\nThe format to inspect one of your powers is\npower player [power number]\nThe format to inspect a monster's power is\npower monster [monster number] [power number]\npower can be shortened to pow, monster to m, and player to p.\nExample:\npow p 1\npow m 1 2",
      "end": "end\nThis command ends your turn.",
      "show": "show and hide\nThese commands allow you to hide and unhide windows.\nThe format is\n[show/hide] window name\nYou may also use all for window name to show or hide all windows besides output and prompt.\nExamples:\nhide all\nshow map",
      "hide": "show and hide\nThese commands allow you to hide and unhide windows.\nThe format is\n[show/hide] window name\nYou may also use all for window name to show or hide all windows besides output and prompt.\nExamples:\nhide all\nshow map",
      "Choices": "choices\nThis command displays the text in the choices window in the output window.\nThe choices window has all of the available choices you can make.\nChoices are either numbered or are a single word.\nEntering either the number or the word selects that choice.",
      "Deck": "deck\nThis command displays the text in the deck window in the output window.\nThe deck window displays your deck size and all cards in the deck.\nOut of combat it displays your master deck.\nIn combat it displays your current deck.",
      "Discard": "discard\nThis command displays the text in the discard window in the output window.\nThe discard window displays your discard size and all cards in your discard.",
      "Event": "event\nThis command displays the event name and text in the event window in the output window.\nThe event window displays the event dialogue and is often used for other dialogue include run score on death or victory.",
      "Hand": "hand\nThis command has two options.\nThe first option displays the text in the hand window in the output window.\nThe hand window contains the cards in your hand and your potions.\nThe second option displays the info of a card in your hand in the output window.\nThe format is\nhand [card number]\nhand can be shortened to h.\nExample:\nh 1\nTo play cards in hand input the card number.\nIf the card has a target input the target number after it.\nExamples:\n0\n1 2",
      "exhaust": "exhaust\nThis command displays your exhaust pile in Output.\nNote that exhaust does not have a window as there are very few reasons to need to check the exhaust pile.",
      "Output": "output\nThis window displays output from various sources.\nThis is the only window that cannot display its text to the output window.\nIt also cannot be hidden.",
      "Log": "log\nThis window displays the log.\nYou can also display the log to output with the log command.\nThis log is meant to be a combat log and is still quite basic.\nIt will track:\nChanges in health and powers for the player and monsters.\nUsed cards and potions.\nApplied powers to playrs and monsters.\nExhausted cards.\nThe user's inputs.",
      "Save": "save/load\nThese commands let you save and load the output window for later viewing.\nFormat is\nsave/load [anything no spaces]\nExample that saves the output of a map command:\nmap 6 4\nsave 6-4\nload 6-4",
      "Load": "save/load\nThese commands let you save and load the output window for later viewing.\nFormat is\nsave/load [anything no spaces]\nExample that saves the output of a map command:\nmap 6 4\nsave 6-4\nload 6-4",
      "Map": "map\nThe map window displays the map that the user can reach.\nThe map command has several uses.\nThe first is to simply display the text in the map window to the output window.\nThe next is to inspect the map.\nThis lets you set a destination and display a map that the user can reach and can reach the destination.\nThis destination will also be tracked in the choice window when moving on the map.\nOptionally you can set a different starting position.\nIf you do so the destination will not be tracked in the choice window.\nmap can be shortened to m\nFormat is:\nmap [start floor] [start x] [floor] [x]\nExamples:\nmap 6 4\nmap 3 1 6 4\nBoth examples had destination 6 4.\nFor a different way to inspect the map check the path command.",
      "path": "path\nThe path command is closely related to the map command.\nIt displays all of the unique paths from point a to point b and tallies the types of nodes on each path.\nIf point a is not set if defaults to where the user is.\nFormat is:\npath [a floor] [a x] [b floor] [b x]\nExamples:\npath 6 4\npath 3 1 6 4\nBoth examples had destination 6 4.",
      "Monster": "monster\nThis command displays the text in the monster window in the output window.\nThe monster window display the info of all alive monsters.\nYou can view what number monsters are assigned in this window.",
      "Orbs": "event\nThis command displays the text in the orbs window in the output window.\nThis window displays the orbs the player has.\nThis is usually exclusive to the class Defect.\nYou can inspect an orb with the format:\norbs index\nExample:\norbs 1",
      "Player": "player\nThis command displays the text in the player window in the output window.\nThis window displays your character's info.\nOut of combat it also displays your potions.",
      "Relic": "relic\nThis command has two options.\nThe first option displays the text in the relic window in the output window.\nThe relic window contains all the relics you own.\nThey are ordered in reverse acquired order.\nThe second option displays a relic's info in the inspect window.\nThe format is\nrelic [relic number]\nExample:\nrelic 5"
    },
    "tutorial": "tutorial\nThe goal of each run is complete 3 acts.\nEach act consists of 15 floors and a boss.\nThe map will mention which boss is at the end of the current act.\nYou may only proceed forward and you cannot change your path once you take it.\nEach floor consists of various rooms and each node is connected to rooms on the next floor.\nUse the map and path commands to inspect and understand the map.\nEach room has a type that is viewable from the map.\nMonster rooms contain combat against normal monsters.\nElite rooms contain combat against elite monsters.\nCampfire rooms contain a campfire which provides a list of services you can pick from.\nTreasure rooms contain a treasure chest.\nShop rooms contain a shop.\nUnknown rooms can contain any of the above and can contain an event.\nThroughout the game you will need to make choices.\nMany of these choices will appear in the Choices window.\nThese choices can appear as a numbered list or as whole words.\nTo pick a numbered choice input the number.\nWhole word choices require inputting the word.\nCombat uses card game mechanics.\nUse cards from your hand to defeat enemies.\nCards cost energy to play.\nAt the start of a new turn you draw a fresh hand and your energy is replenished.\nPLay defensive block spells to prevent incoming damage.\nBlock reduces incoming damage but wears off at the start of the next turn.\nDuring your turn you can observe the enemy's intent.\nView cards in your hand using the hand window or the hand command.\nPlaying cards requires inputting the card number and the target number.\nEnemies are all assigned a number that does not change.\nCard numbers are its position in your hand so it can change as you play cards.\nExamples:\n0 0\n1 4\nYou do not need to input a target if the card does not have a target or if there is only one enemy.\nPotions follow similar rules to cards.\nPotions have the options use, discard, and inspect.\nThe format to use them is:\npot [u,d,i] [potion number] [target number]\nAgain, target number is not needed if the potion has no target or if there is only one enemy.\nExamples:\npot u 0 1\npot d 1\npot i 2\npot u 3\nThroughout the run you will be provided with various rewards.\nCard rewards add a card to your deck.\nDo note that you always use all the cards you have and ways to remove cards are rare.\nRelics are items with passive effects.\nYou can check and inspect relics you have in the relic window.\nYou can inspect choices too with the command:\nc [number]\nUse this to check out rewards before picking them.\nThis should be enough to get you started.\nBe sure to check out the rest of the commands in the help command."
  }
}